In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
engine = sql.connect('temp1000.db')
cursor= engine.cursor()

In [3]:
url = "https://raw.github.com/pandas-dev/pandas/master/pandas/tests/io/data/csv/tips.csv"
tips = pd.read_csv(url)

In [4]:
tips.to_sql('tipsDB', con=engine)
#faz a conexão com a minha "máquina" (vulgo, o data frame que eu criei)

- Visualizar as 5 primeiras Linhas

In [5]:
### SQL #### 
sql_head = 'SELECT * FROM tipsDB LIMIT 5'
cursor.execute(sql_head).fetchall()

[(0, 16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2),
 (1, 10.34, 1.66, 'Male', 'No', 'Sun', 'Dinner', 3),
 (2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3),
 (3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2),
 (4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4)]

In [6]:
### PANDAS ### 
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

- Selecionar algumas Colunas 

- Total_bill, tip, smoker, time

In [7]:
### SQL ### 
sql_columns = 'SELECT total_bill, tip, smoker, time FROM tipsDB LIMIT 5'
cursor.execute(sql_columns).fetchall()

[(16.99, 1.01, 'No', 'Dinner'),
 (10.34, 1.66, 'No', 'Dinner'),
 (21.01, 3.5, 'No', 'Dinner'),
 (23.68, 3.31, 'No', 'Dinner'),
 (24.59, 3.61, 'No', 'Dinner')]

In [8]:
### PANDAS #### 
#isso é retornar uma série, não um dataframe
tips['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [9]:
#para o dataframe, eu preciso de [] dentro de []
tips[['total_bill', 'tip', 'smoker', 'time']].head()

   total_bill   tip smoker    time
0       16.99  1.01     No  Dinner
1       10.34  1.66     No  Dinner
2       21.01  3.50     No  Dinner
3       23.68  3.31     No  Dinner
4       24.59  3.61     No  Dinner

 - Assign Nova Coluna 

 - tip_rate = tip/total_bill

In [10]:
### SQL ####
sql_assign = 'SELECT *, tip/total_bill as tip_rate FROM tipsDB LIMIT 5'
cursor.execute(sql_assign).fetchall()

cl_name = [] #buscando o nome das colunas
for name in cursor.description:
  cl_name.append(name[0])
print(cl_name)

for row in cursor.fetchall():
  print(row)

['index', 'total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size', 'tip_rate']

In [11]:
### PANDAS ### 
tips.assign(tip_rate=tips['tip']/tips['total_bill']).head()

   total_bill   tip     sex smoker  day    time  size  tip_rate
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [12]:
tips.head() #podemos ver que a nova coluna não foi incorporada na original

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [13]:
tips['tip_rate'] = tips['tip']/tips['total_bill'] #incorporando a nova coluna

In [14]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  tip_rate
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [15]:
### WHERE - SQL ####
sql_where = 'SELECT * FROM tipsDB WHERE smoker="No" LIMIT 5'
cursor.execute(sql_where).fetchall()

[(0, 16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2),
 (1, 10.34, 1.66, 'Male', 'No', 'Sun', 'Dinner', 3),
 (2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3),
 (3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2),
 (4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4)]

In [16]:
### WHERE - PANDAS ####
tips[tips['smoker'] == 'No'].head()

   total_bill   tip     sex smoker  day    time  size  tip_rate
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [17]:
sql_upper = 'SELECT * FROM tipsDB WHERE UPPER(smoker)=UPPER("no") LIMIT 5' #o UPPER faz a busca toda reconhecer o que estiver em minusculo
cursor.execute(sql_upper).fetchall()

[(0, 16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2),
 (1, 10.34, 1.66, 'Male', 'No', 'Sun', 'Dinner', 3),
 (2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3),
 (3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2),
 (4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4)]

In [18]:
#tips[tips['smoker'].str.upper() == str.upper('no')].head()  - eu estou acessando o objeto string, que é o objeto nativo do python = mas também funciona o upper

In [19]:
### WHERE - SQL ###
### time = Dinner AND tip > 5.00 ###

sql_where2 = 'SELECT * FROM tipsDB WHERE time="Dinner" AND tip > 5.00'
cursor.execute(sql_where2).fetchall()

[(23, 39.42, 7.58, 'Male', 'No', 'Sat', 'Dinner', 4),
 (44, 30.4, 5.6, 'Male', 'No', 'Sun', 'Dinner', 4),
 (47, 32.4, 6.0, 'Male', 'No', 'Sun', 'Dinner', 4),
 (52, 34.81, 5.2, 'Female', 'No', 'Sun', 'Dinner', 4),
 (59, 48.27, 6.73, 'Male', 'No', 'Sat', 'Dinner', 4),
 (116, 29.93, 5.07, 'Male', 'No', 'Sun', 'Dinner', 4),
 (155, 29.85, 5.14, 'Female', 'No', 'Sun', 'Dinner', 5),
 (170, 50.81, 10.0, 'Male', 'Yes', 'Sat', 'Dinner', 3),
 (172, 7.25, 5.15, 'Male', 'Yes', 'Sun', 'Dinner', 2),
 (181, 23.33, 5.65, 'Male', 'Yes', 'Sun', 'Dinner', 2),
 (183, 23.17, 6.5, 'Male', 'Yes', 'Sun', 'Dinner', 4),
 (211, 25.89, 5.16, 'Male', 'Yes', 'Sat', 'Dinner', 4),
 (212, 48.33, 9.0, 'Male', 'No', 'Sat', 'Dinner', 4),
 (214, 28.17, 6.5, 'Female', 'Yes', 'Sat', 'Dinner', 3),
 (239, 29.03, 5.92, 'Male', 'No', 'Sat', 'Dinner', 3)]

In [20]:
### WHERE - PANDAS ###
### time = Dinner AND tip > 5.00 ###
tips[(tips['time']=="Dinner") & (tips['tip'] > 5.00)].head()

    total_bill   tip     sex smoker  day    time  size  tip_rate
23       39.42  7.58    Male     No  Sat  Dinner     4  0.192288
44       30.40  5.60    Male     No  Sun  Dinner     4  0.184211
47       32.40  6.00    Male     No  Sun  Dinner     4  0.185185
52       34.81  5.20  Female     No  Sun  Dinner     4  0.149382
59       48.27  6.73    Male     No  Sat  Dinner     4  0.139424

In [21]:
### IS NULL - SQL #### 
sql_update = 'UPDATE tipsDB set tip=NULL WHERE tip=7.58'
cursor.execute(sql_update)

In [22]:
sql_ISNULL = 'SELECT * FROM tipsDB WHERE tip is NULL'
cursor.execute(sql_ISNULL).fetchall()

[(23, 39.42, None, 'Male', 'No', 'Sat', 'Dinner', 4)]

In [23]:
### IS NULL - PANDAS #### 
tips.loc[tips['tip']==7.58, 'tip'] = None

In [24]:
tips[tips['tip'].isna()]

    total_bill  tip   sex smoker  day    time  size  tip_rate
23       39.42  NaN  Male     No  Sat  Dinner     4  0.192288

In [25]:
### GROUP BY - SQL ###
sql_groupby = 'SELECT sex, count(*) FROM tipsDB GROUP BY sex'
cursor.execute(sql_groupby).fetchall()

[('Female', 87), ('Male', 157)]

In [26]:
### GROUP BY - PANDAS ###
tips.groupby('sex').size()

sex
Female     87
Male      157
dtype: int64

In [27]:
### GROUP BY - SQL USANDO FUNCOES NATIVAS DO SQL  ###
# smoker, day
# agg - count, valor médio da gorjeta (tip)
sql_groupby2 = 'SELECT smoker, day, COUNT(*), AVG(tip) FROM tipsDB GROUP BY smoker, day'
cursor.execute(sql_groupby2).fetchall()

[('No', 'Fri', 4, 2.8125),
 ('No', 'Sat', 45, 3.001136363636364),
 ('No', 'Sun', 57, 3.1678947368421055),
 ('No', 'Thur', 45, 2.673777777777778),
 ('Yes', 'Fri', 15, 2.714),
 ('Yes', 'Sat', 42, 2.8754761904761903),
 ('Yes', 'Sun', 19, 3.5168421052631573),
 ('Yes', 'Thur', 17, 3.0299999999999994)]

In [28]:
### GROUP BY - SQL USANDO FUNCOES NATIVAS DO PANDAS  ###
tips.groupby(['smoker', 'day']).agg({"tip":['size', 'mean']}) 
#groupby - estou escolhendo parametros / agg - agregando quantos 'tips' tiveram, e qual foi a 'média' para essas 2 combinações determinadas em 'group by'

             tip
            size      mean
smoker day
No     Fri     4  2.812500
       Sat    45  3.001136
       Sun    57  3.167895
       Thur   45  2.673778
Yes    Fri    15  2.714000
       Sat    42  2.875476
       Sun    19  3.516842
       Thur   17  3.030000

In [29]:
import numpy as np
values = np.random.randn(4)
values = np.append(values,np.nan)
values

array([-1.15442315, -0.22549145, -0.62070461, -2.79222047,         nan])

In [30]:
import numpy as np
values = np.random.randn(4)
values = np.append(values,np.nan)

df1 = pd.DataFrame({"key": ["A", "B", "C", "D","E"], "value": values})
df2 = pd.DataFrame({"key": ["B", "D", "D", "E"], "value": np.random.randn(4)})


df1.to_sql('df1DB', con=engine)
df2.to_sql('df2DB', con=engine)

In [31]:
### INNER_JOIN - SQL ####

sql_join = 'SELECT * FROM df1DB INNER JOIN df2DB ON df1DB.key = df2DB.key'
cursor.execute(sql_join).fetchall()

[(1, 'B', 0.08436306323340359, 0, 'B', 0.05327940844468584),
 (3, 'D', 0.4993334218307816, 1, 'D', 1.4066048175967802),
 (3, 'D', 0.4993334218307816, 2, 'D', -0.6736846704897955),
 (4, 'E', None, 3, 'E', -0.5987446525164009)]

In [32]:
### INNER_JOIN - PANDAS #### 
pd.merge(df1, df2, on='key')

  key   value_x   value_y
0   B  0.084363  0.053279
1   D  0.499333  1.406605
2   D  0.499333 -0.673685
3   E       NaN -0.598745

In [33]:
### LEFT JOIN - SQL ####
sql_LEFTjoin = 'SELECT * FROM df1DB LEFT JOIN df2DB ON df1DB.key = df2DB.key'
cursor.execute(sql_LEFTjoin).fetchall()

[(0, 'A', 0.6439679213994786, None, None, None),
 (1, 'B', 0.08436306323340359, 0, 'B', 0.05327940844468584),
 (2, 'C', -0.11015379232003171, None, None, None),
 (3, 'D', 0.4993334218307816, 1, 'D', 1.4066048175967802),
 (3, 'D', 0.4993334218307816, 2, 'D', -0.6736846704897955),
 (4, 'E', None, 3, 'E', -0.5987446525164009)]

In [34]:
### LEFT JOIN - PANDAS ####
pd.merge(df1, df2, on='key', how = "left")

  key   value_x   value_y
0   A  0.643968       NaN
1   B  0.084363  0.053279
2   C -0.110154       NaN
3   D  0.499333  1.406605
4   D  0.499333 -0.673685
5   E       NaN -0.598745